Revit 2027 API
RebarConstraint.GetTargetElement Method
Overload List
Name | Description
GetTargetElement() |  Gets the Element object (either Host or Rebar) which provides the target reference at index 0 for this constraint. Will throw exception if it's a multi target constraint.
GetTargetElement(Int32) |  Gets the Element object (either Host or Rebar) which provides the target reference at specified index for this constraint.
Top
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace